## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show Summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| add    | `aws_route53_resolver_firewall_domain_list.allowed`              |
|        | `aws_route53_resolver_firewall_domain_list.blocked`              |
|        | `aws_route53_resolver_firewall_rule.allowed`                     |
|        | `aws_route53_resolver_firewall_rule.blocked`                     |
|        | `aws_route53_resolver_firewall_rule_group.api_rules`             |
|        | `aws_route53_resolver_firewall_rule_group_association.api_rules` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_resolver_firewall_domain_list.allowed will be created
  + resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      + arn      = (known after apply)
      + domains  = [
          + "*.ca-central-1.rds.amazonaws.com",
          + "*.cyber.gc.ca",
          + "*.s3.ca-central-1.amazonaws.com",
          + "current.cvd.clamav.net",
          + "database.clamav.net",
          + "lambda.ca-central-1.amazonaws.com",
          + "secretsmanager.ca-central-1.amazonaws.com",
          + "sns.ca-central-1.amazonaws.com",
          + "ssm.ca-central-1.amazonaws.com",
          + "sts.amazonaws.com",
        ]
      + id       = (known after apply)
      + name     = "AllowedDomains"
      + tags     = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_route53_resolver_firewall_domain_list.blocked will be created
  + resource "aws_route53_resolver_firewall_domain_list" "blocked" {
      + arn      = (known after apply)
      + domains  = [
          + "*",
        ]
      + id       = (known after apply)
      + name     = "BlockedDomains"
      + tags     = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_route53_resolver_firewall_rule.allowed will be created
  + resource "aws_route53_resolver_firewall_rule" "allowed" {
      + action                  = "ALLOW"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "AllowedDomains"
      + priority                = 100
    }

  # aws_route53_resolver_firewall_rule.blocked will be created
  + resource "aws_route53_resolver_firewall_rule" "blocked" {
      + action                  = "BLOCK"
      + block_response          = "NODATA"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "BlockedDomains"
      + priority                = 200
    }

  # aws_route53_resolver_firewall_rule_group.api_rules will be created
  + resource "aws_route53_resolver_firewall_rule_group" "api_rules" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "ApiRules"
      + owner_id     = (known after apply)
      + share_status = (known after apply)
      + tags         = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_route53_resolver_firewall_rule_group_association.api_rules will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "api_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = (known after apply)
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "ApiRules"
      + priority               = 100
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-024adeef6279a5350"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_firewall_rule_group_association.api_rules"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_resolver_query_log_config.route53_vpc_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr_dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sts"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_ip_set.ip_allowlist"]

27 tests, 17 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
